In [2]:
import pandas as pd
data1=pd.read_excel(r'C:\Users\azrs4\Desktop\dat1.xlsx')

In [3]:
data1

      Name  Age  Salary
0      Ram   23   10000
1   Suresh   22   18000
2    Pinky   30   20000
3  Lalitha   32   25000

In [5]:
data2=pd.read_csv(r'C:\Users\azrs4\Desktop\dat2.csv')

In [6]:
data2

     Name  Age      Place
0     Raj   23    Varkala
1  Sumesh   22   Attingal
2   lilly   26  Palachira

In [11]:
data3=pd.read_csv(r'C:\Users\azrs4\Desktop\dat3.tsv',sep='\t')
data3

    Name  Age place
0    Saj   22    pp
1   alim   23    oo
2  susan   24    ll

In [12]:
import os

In [14]:
os.getcwd()

'C:\\Users\\azrs4'